tap "homebrew/services"
tap "homebrew/bundle"
tap "heroku/brew"

# SETUP
brew "chezmoi"
brew "mas"

# SHELL
brew "bat"
brew "cdargs"
brew "ctags"
brew "direnv"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "mackup"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "tldr"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# DEV
brew "docker-completion"
brew "glib"
brew "heroku/brew/heroku"
brew "libpq"
brew "libsodium"
brew "overmind"
brew "postgresql@14", restart_service: false
brew "redis", restart_service: false
brew "vips"
brew "yarn"

# CASK APPS
cask "1password-cli"
cask "1password"
cask "dash"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "moonlight"
cask "ngrok"
cask "orion"
cask "shottr"
cask "suspicious-package"
cask "transmit"
cask "vscodium"

# FONTS
cask "font-source-code-pro-for-powerline"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-meslo-lg-nerd-font"

# MAC APP STORE
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "DevTools", id: 6444775708
mas "Fantastical Calendar", id: 975937182
mas "Hush Nag Blocker", id: 1544743900
mas "Kagi for Safari", id: 1622835804
mas "Lanscan", id: 472226235
mas "Okta Verify", id: 490179405
mas "Widgy Widgets", id: 1524540481
mas "WireGuard", id: 1451685025
