tap "homebrew/services"
tap "homebrew/bundle"
tap "heroku/brew"

# SETUP
brew "chezmoi"
brew "mas"

# SHELL
brew "git"
brew "1password-cli"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "terminal-notifier"
brew "fortune"
brew "bat"
brew "cdargs"
brew "ctags"
brew "stow"

# DEV
brew "heroku/brew/heroku"

# CASK APPS
cask "iterm2"
cask "vscodium"
cask "suspicious-package"
cask "dash"

# MAC APP STORE

mas "WireGuard", id: 1451685025
mas "Fantastical Calendar", id: 975937182
mas "Okta Verify", id: 490179405
mas "Hush Nag Blocker", id: 1544743900
mas "Lanscan", id: 472226235
mas "Kagi for Safari", id: 1622835804